Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
/* =============================================================================
 * Private Definitions
 * =============================================================================
 */

/** @brief UART configuration constants */
typedef enum : uint32_t {
  /**
   * @brief Default baud rate: 921600 bps
   *
   * Max standard rate that hits <2%% error on SCI9 with PCLKA=120 MHz.
   * Formula (ABCS=0/CKS=00): BRR = PCLKA / (32 * B) - 1.
   *   120e6 / (32 * 921600) - 1 = 4.07 -> BRR = 3
   *   Actual rate = 120e6 / (32 * (3 + 1)) = 937500 bps
   *   Error vs 921600 = (937500 - 921600) / 921600 = +1.72%% (well within ~3%% UART tolerance)
   *
   * Well within the CY7C65213 USB-UART bridge's 3 Mbps ceiling.
   */
  k_uart_default_baudrate      = 115200, /* matches motors_rtos/HIL-tests; 921600 at PCLKB=60 MHz has 1.7% BRR rounding error */
  k_uart_bit_time_delay_cycles = 125, /**< ~1.09us at 921600 bps, ~260 cycles @240 MHz */
} uart_config_constants_t;

/** @brief SCI register values */
typedef enum : uint8_t {
  k_sci_scr_disabled     = 0x00, /**< SCR: All functions disabled */
  k_sci_scr_tx_enabled   = 0x20, /**< SCR: Transmit enabled (TE=1) */
  k_sci_scr_rx_enabled   = 0x10, /**< SCR: Receive enabled (RE=1) */
  k_sci_scr_txrx_enabled = 0x30, /**< SCR: TX + RX enabled (TE=1, RE=1) */
  k_sci_smr_async_8n1    = 0x00, /**< SMR: Async mode, 8 data bits, no parity, 1 stop bit, PCLK/1 */
  k_sci_semr_default     = 0x00, /**< SEMR: Default extended mode */
  k_sci_ssr_tdre_flag    = 0x80, /**< SSR: Transmit data register empty flag */
  k_sci_ssr_rdrf_flag    = 0x40, /**< SSR: Receive data register full flag */
  k_sci_ssr_orer_flag    = 0x20, /**< SSR: Overrun error flag */
  k_sci_ssr_fer_flag     = 0x10, /**< SSR: Framing error flag */
  k_sci_ssr_per_flag     = 0x08, /**< SSR: Parity error flag */
  k_sci_ssr_error_mask   = 0x38, /**< SSR: All error flags mask */
} sci_register_values_t;

/** @brief Integer to string buffer constants */
typedef enum : uint8_t {
  k_uart_int_buffer_size = 12, /**< Buffer size for int32 to string (enough for -2147483648) */
  k_uart_base_10         = 10, /**< Base 10 for decimal conversion */
} uart_int_constants_t;

/** @brief Hex digit constants */
typedef enum : uint8_t {
  k_uart_hex_max_digits  = 8,    /**< Maximum hex digits to print (32-bit value) */
  k_uart_hex_min_digits  = 1,    /**< Minimum hex digits to print */
  k_uart_hex_zero_digits = 0,    /**< Zero digits value */
  k_uart_hex_nibble_bits = 4,    /**< Bits per hex nibble */
  k_uart_hex_nibble_mask = 0x0F, /**< Mask for hex nibble */
} uart_hex_constants_t;

/** @brief BRR calculation constants */
typedef enum : uint16_t {
  k_brr_divisor_n0     = 32,  /**< Divisor for n=0 (CKS=00): 64 * 2^(2n-1) = 32 */
  k_brr_multiplier     = 4,   /**< Multiplier per CKS increment (2^2) */
  k_brr_max_value      = 255, /**< Maximum BRR register value */
  k_brr_min_value      = 0,   /**< Minimum BRR register value */
  k_brr_formula_offset = 1,   /**< BRR formula subtract-1 offset: BRR = (PCLKB/(32*B)) - 1 */
} brr_constants_t;

/** @brief MSTPCRB register bit manipulation constants */
typedef enum : uint32_t {
  k_uart_mstpcrb_bit_set = 1UL, /**< Single-bit mask for MSTPCRB bit-clear operations */
} uart_mstpcrb_constants_t;

/** @brief Maximum SCI channels (array size, must be enum for compile-time constant) */
typedef enum : uint8_t {
  k_uart_channel_min       = 0,  /**< Minimum UART channel (SCI0) */
  k_uart_array_size        = 13, /**< Array size for s_channel_initialized */
  k_uart_max_mstpb_channel = 7,  /**< Last contiguous MSTPCRB channel (SCI0-SCI7, bits 31-24) */
  k_uart_mstpc_channel_min = 8,  /**< First MSTPCRC channel (SCI8 at MSTPCRC bit 27) */
  k_uart_mstpc_channel_max = 11, /**< Last MSTPCRC channel (SCI11 at MSTPCRC bit 24) */
  k_uart_pclka_channel_min = 7,  /**< First channel using PCLKA for BRR (SCIi: SCI7-SCI11) */
  k_uart_pclka_channel_max = 11, /**< Last channel using PCLKA for BRR (SCIi: SCI7-SCI11) */
  k_uart_max_channels      = 13, /**< Maximum valid channel value (SCI channels 0-12) */
} uart_internal_constants_t;

/**
 * @enum uart_validation_limits_t
 * @brief Baud rate validation bounds for uart_init_channel() parameter checking
 *
 * @details
 * Defines the closed interval [k_uart_baudrate_min, k_uart_baudrate_max] that
 * every requested baud rate must satisfy before the driver attempts to program
 * the BRR register.
 *
 * The maximum is derived directly from the BRR formula for n=0 (CKS=00):
 * @f[
 *   \text{BRR} = \frac{\text{PCLKB}}{32 \times B} - 1 \geq 0
 *   \implies B \leq \frac{\text{PCLKB}}{32}
 * @f]
 * A BRR of 0 corresponds to the fastest achievable baud rate at the current
 * PCLKB frequency, so requesting anything higher would underflow the register.
 *
 * The minimum is 1 bps, which prevents a divide-by-zero in the BRR formula.
 * In practice, any baud rate below ~9600 is impractical on a 60 MHz PCLKB, but
 * the lower bound is kept permissive to avoid false negatives during testing.
 *
 * @invariant k_uart_baudrate_min must be > 0 to prevent division by zero in
 * internal_calculate_brr().
 * @invariant k_uart_baudrate_max must equal k_pclkb_hz / k_brr_divisor_n0 so
 * that the computed BRR is always >= 0 (i.e., no register underflow).
 *
 * @par Example:
 * @code{.c}
 * // Validation performed inside uart_init_channel()
 * if ((config->baudrate < k_uart_baudrate_min) ||
 *     (config->baudrate > k_uart_baudrate_max)) {
 *   return k_rx_err_invalid_arg;
 * }
 * @endcode
 *
 * @see uart_init_channel() Uses these bounds to validate the baudrate field
 * @see internal_calculate_brr() Computes the actual BRR register value
 * @see brr_constants_t BRR formula divisor constants
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_uart_baudrate_min =
    1, /**< Minimum valid baud rate (bps); must be > 0 to avoid divide-by-zero in BRR formula */
  k_uart_baudrate_max =
    (k_pclkb_hz /
     k_brr_divisor_n0), /**< Maximum valid baud rate (bps); BRR = 0 at this rate, higher values would underflow */
} uart_validation_limits_t;

