Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  /* Read available bytes */
  *bytes_read = 0;
  for (uint16_t i = 0; i < length; i++) {
    char           c;
    const rx_err_t err = uart_getc_channel(channel, &c);
    if (err == k_rx_err_empty) {
      /* No more data available */
      break;
    }
    if (err != k_rx_ok) {
      return err;
    }
    data[i] = (uint8_t)c;
    (*bytes_read)++;
  }

  return k_rx_ok;
}

/**
 * @brief Check if receive data is available on UART channel
 *
 * @details
 * Checks the RDRF (Receive Data Register Full) flag in the SSR register of
 * the specified SCI channel. Provides a non-destructive peek at receive
 * availability without consuming any data from the buffer.
 *
 * **Algorithm steps:**
 * 1. Validate available pointer (NULL check)
 * 2. Validate channel number and initialization state
 * 3. Get SCI register base address
 * 4. Read SSR and test RDRF bit; store boolean result in *available
 *
 * @param[in] channel UART channel to check (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *
 * @param[out] available Pointer to store result
 *   - **On success**: true if RDRF flag set (data ready), false otherwise
 *   - **On error**: value undefined
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success; *available set to data availability status
 * @retval k_rx_err_null_ptr available is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel number or invalid register pointer
 * @retval k_rx_err_invalid_state Channel not initialized
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre available must point to valid bool storage
 *
 * @post *available reflects current RDRF state
 * @post No data is consumed from the receive buffer
 *
 * @note Non-destructive - does not read RDR or clear any flags
 * @note RDRF can be set again immediately after reading if UART is receiving
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~2 us
 * - Stack usage: 16 bytes
 *
 * @par Example:
 * @code{.c}
 * bool ready = false;
 * if (uart_rx_available(k_uart_channel_9, &ready) == k_rx_ok && ready) {
 *   char c;
 *   uart_getc_channel(k_uart_channel_9, &c);
 * }
 * @endcode
 *
 * @see uart_getc_channel() Read single character
 * @see uart_read_channel() Read multiple bytes
 *
 * @since Version 1.0.0
 */
rx_err_t uart_rx_available(const uart_channel_t channel, bool* available)
{
  /* Validate parameters */
  if (available == nullptr) {
    return k_rx_err_null_ptr;
  }

  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  /* Get SCI register base */
  const volatile rx_sci_regs_t* sci = sci_get_channel(channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Check RDRF flag */
  *available = ((sci->ssr & k_sci_ssr_rdrf_flag) != k_uart_flag_clear);

  return k_rx_ok;
}

/* =============================================================================
 * UART Debug Functions - Convenience Wrappers for SCI9
 * =============================================================================
 */

/**
 * @brief Initialize default debug UART channel (SCI9 at 115200 baud)
 *
 * @details
 * Convenience function to initialize SCI9 with default debug settings:
 * - **Channel**: SCI9
 * - **Baud rate**: 115200 bps
 * - **TX pin**: PB7 (TXD9)
 * - **RX pin**: PB6 (RXD9)
 * - **Format**: 8N1 (8 data bits, no parity, 1 stop bit)
 *
 * SCI9 is connected to the CY7C65213 USB-UART bridge on the STAR PCB,
 * providing a virtual COM port when connected via USB.
 *
 * **Algorithm steps:**
 * 1. Create uart_channel_config_t with default values
 * 2. Call uart_init_channel() with the configuration
 * 3. Return result
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, debug UART ready
 * @retval k_rx_err_invalid_state SCI9 already initialized
 *
 * @pre System clocks must be initialized (PCLKB = 60 MHz)
 * @pre SCI9 must not be already initialized
 *
 * @post SCI9 configured and ready for TX/RX at 115200 baud
 * @post uart_debug_puts(), uart_debug_putc() etc. are functional
 *
 * @note Call once during early system initialization
 * @note Call before any other debug output functions
 * @warning Must be called before ThreadX starts if debug output is needed during init
 *
 * @par Thread Safety:
 * Not thread-safe. Call once during startup before ThreadX.
 *
 * @par Performance:
 * - Execution time: ~50 us
 * - Stack usage: 64 bytes
 *
 * @par Example:
 * @code{.c}
 * void system_init(void)
 * {
 *   // Initialize clocks first
 *   rx_clock_init();
 *
 *   // Initialize debug UART for early output
 *   rx_err_t err = uart_debug_init();
 *   if (err != k_rx_ok) {
 *     // Cannot print error - no UART!
 *     // Could blink LED or set error flag
 *     return;
 *   }
 *
 *   // Now we can print debug messages
 *   uart_debug_puts("[INFO] System starting...\n");
 * }
 * @endcode
 *
 * @see uart_init_channel() Generic channel initialization
 * @see uart_debug_puts() Debug string output
 * @see uart_debug_putc() Debug character output
 *
 * @since Version 1.0.0
 */
rx_err_t uart_debug_init(void)
{
  const uart_channel_config_t config = {
    .channel  = (uart_channel_t)k_uart_debug_channel,
    .baudrate = k_uart_default_baudrate,
    .tx_gpio  = (rx_port_pin_t)k_uart_debug_tx_gpio,
    .rx_gpio  = (rx_port_pin_t)k_uart_debug_rx_gpio,
  };
  return uart_init_channel(&config);
}

#if !RX_IS_SIMULATOR
/* =============================================================================
 * Hardware Mode: Debug UART Functions
 * =============================================================================
 * These functions use the SCI9 UART hardware for debug output.
 * In simulator mode, these are replaced by inline implementations in rx_log.h
 * that redirect to stdout.
 * =============================================================================
 */

/**
 * @brief Transmit single character on debug UART (SCI9)
 *
 * @details
 * Convenience wrapper around uart_putc_channel() for the fixed debug channel
 * (SCI9). Errors are silently ignored to allow use in early initialization
 * contexts where error propagation is not yet possible.
 *
 * **Algorithm steps:**
 * 1. Call uart_putc_channel(k_uart_debug_channel, data)
 * 2. Cast return value to (void) - errors discarded
 *
 * @param[in] data Character to transmit (0x00-0xFF)
 *   - **Special handling**: '\n' is NOT converted; use uart_debug_puts() for text
 *
 * @pre uart_debug_init() must have been called successfully
 * @pre SCI9 must be initialized and TX enabled
 *
 * @post Character written to SCI9 TDR and transmission started
 * @post Any errors are silently discarded
 *
 * @note Error return from uart_putc_channel() is intentionally discarded
 * @note For error-checked output use uart_putc_channel() directly
 * @warning Only available when RX_IS_SIMULATOR is 0 (hardware builds)
 *
 * @par Thread Safety:
 * Not safe for concurrent access on SCI9 without external mutex.
 *
 * @par Performance:
 * - Execution time: ~90 us @ 115200 baud
 * - Stack usage: 16 bytes
 *
 * @par Example:
 * @code{.c}
 * uart_debug_putc('A');     // Send 'A'
 * uart_debug_putc('\r');    // Carriage return
 * uart_debug_putc('\n');    // Line feed
 * @endcode
 *
 * @see uart_debug_puts() Transmit string with newline conversion
 * @see uart_putc_channel() Error-checked single character transmit
 *
 * @since Version 1.0.0
 */
void uart_debug_putc(const char data)
{
  /* Ignore errors for debug output (used in early init before error handling) */
  (void)uart_putc_channel((uart_channel_t)k_uart_debug_channel, data);
}

/**
 * @brief Transmit null-terminated string on debug UART with newline conversion
 *
 * @details
 * Transmits a null-terminated string to SCI9 with automatic LF-to-CR+LF
 * conversion for terminal compatibility. Enforces a maximum length of
 * k_uart_max_str_len (256) characters per NASA Power of 10 Rule 2.
 * Silently returns on NULL pointer to allow safe use in early init.
 *
 * **Algorithm steps:**
 * 1. Return immediately if str is nullptr (defensive, no error return)
 * 2. For each character up to k_uart_max_str_len:
 *    a. Stop at null terminator
 *    b. If '\n', send '\r' first
 *    c. Send character via uart_debug_putc()
 *
 * @param[in] str Pointer to null-terminated ASCII string
 *   - **Maximum length**: 256 characters (k_uart_max_str_len)
 *   - **Null handling**: Returns silently if nullptr
 *   - **Encoding**: ASCII; '\n' converted to '\r\n'
 *
 * @pre uart_debug_init() must have been called successfully
 * @pre str should point to a null-terminated string in valid memory
 *
 * @post All characters up to null terminator transmitted to SCI9
 * @post Each '\n' replaced by '\r\n' in the transmitted output
 *
 * @note No return value - errors from uart_debug_putc() are silently discarded
 * @note String truncated at k_uart_max_str_len (256) characters
 * @warning Only available when RX_IS_SIMULATOR is 0 (hardware builds)
 *
 * @par Thread Safety:
 * Not safe for concurrent access on SCI9 without external mutex.
 *
 * @par Performance:
 * - Execution time: ~90 us per character @ 115200 baud
 * - Stack usage: 24 bytes
 *
 * @par Example:
 * @code{.c}
 * uart_debug_puts("Hello, World!\n");  // Sends "Hello, World!\r\n"
 * uart_debug_puts("[INFO] Boot complete\n");
 * @endcode
 *
 * @see uart_debug_putc() Transmit single character
 * @see uart_debug_putint() Transmit decimal integer
 * @see uart_puts_channel() Error-checked string transmit
 *
 * @since Version 1.0.0
 */
void uart_debug_puts(const char* str)
{
  if (str == nullptr) {
    return;
  }

  /* Delegate to uart_puts_channel which already handles LF->CRLF conversion,
   * bounded iteration (k_uart_max_str_len), and per-character error checking. */
  (void)uart_puts_channel((uart_channel_t)k_uart_debug_channel, str);
}

/**
 * @brief Transmit signed 32-bit integer as decimal string on debug UART
 *
 * @details
 * Converts a signed 32-bit integer to a decimal ASCII string and transmits
 * it on SCI9. Handles INT32_MIN correctly by using int64_t for the negation.
 * Uses a fixed-size stack buffer (k_uart_int_buffer_size = 12) built in
 * reverse then passed to uart_debug_puts().
 *
 * **Algorithm steps:**
 * 1. Determine sign; compute abs_value as uint32_t
 * 2. Null-terminate the buffer end
 * 3. Build digits right-to-left (statically bounded by k_uart_int_buffer_size)
 * 4. Prepend '-' if negative
 * 5. Call uart_debug_puts() with the resulting substring pointer
 *
 * @param[in] value Signed 32-bit integer to print
 *   - **Valid range**: INT32_MIN (-2147483648) to INT32_MAX (2147483647)
 *   - **INT32_MIN handling**: Correctly handled via int64_t cast
 *
 * @pre uart_debug_init() must have been called successfully
 * @pre uart_debug_puts() must be functional
 *
 * @post Decimal representation of value transmitted on SCI9
 * @post Leading zeros suppressed; negative values prefixed with '-'
 *
 * @note No return value - output errors are silently discarded
 * @note Buffer is stack-allocated; safe for re-entrant calls on different tasks
 * @warning Only available when RX_IS_SIMULATOR is 0 (hardware builds)
 *
 * @par Thread Safety:
 * Not safe for concurrent access on SCI9 without external mutex.
 *
 * @par Performance:
 * - Execution time: ~90 us per digit @ 115200 baud + digit-loop overhead
 * - Stack usage: 32 bytes (buffer + locals)
 *
 * @par Example:
 * @code{.c}
 * uart_debug_puts("Value: ");
 * uart_debug_putint(42);          // Sends "42"
 * uart_debug_putint(-2147483648); // Sends "-2147483648"
 * uart_debug_putc('\n');
 * @endcode
 *
 * @see uart_debug_puthex() Print value in hexadecimal
 * @see uart_debug_puts() Underlying string transmit
 *
 * @since Version 1.0.0
 */
void uart_debug_putint(const int32_t value)
{
  char  buffer[k_uart_int_buffer_size]; /* Enough for -2147483648 */
  char* p = buffer + sizeof(buffer) - 1;

  /* Handle negative numbers */
  const bool is_negative = (value < 0);
  uint32_t   abs_value   = is_negative ? (uint32_t)(-(int64_t)value) : (uint32_t)value;

  /* Null terminate */
  *p = '\0';

  /* Convert to string (reverse order, statically bounded) */
  for (uint8_t i = 0; i < k_uart_int_buffer_size - 1; ++i) {
    *(--p) = (char)('0' + (abs_value % k_uart_base_10));
    abs_value /= k_uart_base_10;
    if (abs_value == 0) {
      break; /* All digits processed */
    }
    if (p <= buffer) {
      break; /* Buffer limit reached (should not happen with correct sizing) */
    }
  }

